/* SMTP Server address */
"Address:" = "Adresa:";

/* Authentication checkbox */
"Authentication" = "Autentificare";

/* Title for from field */
"From:" = "De la:";

/* No security option */
"None" = "Nimic";

/* password field */
"Password:" = "Parolă:";

/* SMTP Server port */
"Port:" = "Port:";

/* Security options title */
"Security:" = "Securitate:";

/* Title for box containing SMTP server details */
"SMTP Server:" = "Server SMTP:";

/* Title for subject prefix field */
"Subject prefix:" = "Prefixul subiectului:";

/* TLS if possible security option */
"TLS if possible" = "TLS dacă este posibil";

/* TLS or close security option */
"TLS or close" = "TLS sau închide";

/* Title for to field */
"To:" = "Către:";

/* Username field */
"Username:" = "Nume utilizator:";

